Revit 2027 API
BuiltInFailures.EditingFailures.UnableToTransformElement Property
 Attempted an invalid element rotate, mirror, or move.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToTransformElement { get; }
Public Shared ReadOnly Property UnableToTransformElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToTransformElement {
	FailureDefinitionId^ get ();
}
static member UnableToTransformElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace